[
	{
		"id": "http://zotero.org/users/1780674/items/RTESGFHC",
		"type": "article-journal",
		"title": "Toward a metabolic theory of ecology",
		"container-title": "Ecology",
		"page": "1771-1789",
		"volume": "85",
		"issue": "7",
		"source": "esajournals.org (Atypon)",
		"abstract": "Metabolism provides a basis for using first principles of physics, chemistry, and biology to link the biology of individual organisms to the ecology of populations, communities, and ecosystems. Metabolic rate, the rate at which organisms take up, transform, and expend energy and materials, is the most fundamental biological rate. We have developed a quantitative theory for how metabolic rate varies with body size and temperature. Metabolic theory predicts how metabolic rate, by setting the rates of resource uptake from the environment and resource allocation to survival, growth, and reproduction, controls ecological processes at all levels of organization from individuals to the biosphere. Examples include: (1) life history attributes, including development rate, mortality rate, age at maturity, life span, and population growth rate; (2) population interactions, including carrying capacity, rates of competition and predation, and patterns of species diversity; and (3) ecosystem processes, including rates of biomass production and respiration and patterns of trophic dynamics. Data compiled from the ecological literature strongly support the theoretical predictions. Eventually, metabolic theory may provide a conceptual foundation for much of ecology, just as genetic theory provides a foundation for much of evolutionary biology.",
		"URL": "http://www.esajournals.org/doi/abs/10.1890/03-9000",
		"DOI": "10.1890/03-9000",
		"ISSN": "0012-9658",
		"note": "bibtex: brown2004",
		"journalAbbreviation": "Ecology",
		"author": [
			{
				"family": "Brown",
				"given": "James H."
			},
			{
				"family": "Gillooly",
				"given": "James F."
			},
			{
				"family": "Allen",
				"given": "Andrew P."
			},
			{
				"family": "Savage",
				"given": "Van M."
			},
			{
				"family": "West",
				"given": "Geoffrey B."
			}
		],
		"issued": {
			"date-parts": [
				[
					"2004",
					7,
					1
				]
			]
		},
		"accessed": {
			"date-parts": [
				[
					"2015",
					9,
					29
				]
			]
		}
	}
]